RevDeBugInstanceTests/testFile.jmx
<?xml version="1.0" encoding="UTF-8"?><jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">  <hashTree>    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="java" enabled="true">      <stringProp name="TestPlan.comments">This test plan was created by the BlazeMeter converter v.2.4.18. Please contact support@blazemeter.com for further support.</stringProp>      <boolProp name="TestPlan.functional_mode">false</boolProp>      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">        <collectionProp name="Arguments.arguments"/>      </elementProp>      <stringProp name="TestPlan.user_define_classpath"></stringProp>    </TestPlan>    <hashTree>      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header manager" enabled="true">        <collectionProp name="HeaderManager.headers">          <elementProp name="Accept" elementType="Header">            <stringProp name="Header.name">Accept</stringProp>            <stringProp name="Header.value">text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9</stringProp>          </elementProp>          <elementProp name="Upgrade-Insecure-Requests" elementType="Header">            <stringProp name="Header.name">Upgrade-Insecure-Requests</stringProp>            <stringProp name="Header.value">1</stringProp>          </elementProp>          <elementProp name="User-Agent" elementType="Header">            <stringProp name="Header.name">User-Agent</stringProp>            <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.212 Safari/537.36</stringProp>          </elementProp>        </collectionProp>      </HeaderManager>      <hashTree/>      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="var" enabled="true">        <collectionProp name="Arguments.arguments">          <elementProp name="BASE_URL_1" elementType="Argument">            <stringProp name="Argument.name">BASE_URL_1</stringProp>            <stringProp name="Argument.value">20.199.127.147</stringProp>            <stringProp name="Argument.metadata">=</stringProp>          </elementProp>          <elementProp name="PORT" elementType="Argument">            <stringProp name="Argument.name">PORT</stringProp>            <stringProp name="Argument.value"></stringProp>            <stringProp name="Argument.metadata">=</stringProp>          </elementProp>        </collectionProp>      </Arguments>      <hashTree/>      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">          <collectionProp name="Arguments.arguments"/>        </elementProp>        <stringProp name="HTTPSampler.domain"></stringProp>        <stringProp name="HTTPSampler.port"></stringProp>        <stringProp name="HTTPSampler.protocol"></stringProp>        <stringProp name="HTTPSampler.contentEncoding"></stringProp>        <stringProp name="HTTPSampler.path"></stringProp>        <boolProp name="HTTPSampler.image_parser">true</boolProp>        <boolProp name="HTTPSampler.concurrentDwn">true</boolProp>        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>        <stringProp name="HTTPSampler.connect_timeout"></stringProp>        <stringProp name="HTTPSampler.response_timeout"></stringProp>      </ConfigTestElement>      <hashTree/>      <DNSCacheManager guiclass="DNSCachePanel" testclass="DNSCacheManager" testname="DNS Cache Manager" enabled="true">        <collectionProp name="DNSCacheManager.servers"/>        <boolProp name="DNSCacheManager.clearEachIteration">true</boolProp>        <boolProp name="DNSCacheManager.isCustomResolver">false</boolProp>      </DNSCacheManager>      <hashTree/>      <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">        <collectionProp name="AuthManager.auth_list"/>        <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>      </AuthManager>      <hashTree/>      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">        <collectionProp name="CookieManager.cookies">         <elementProp name="revdebug.jwt.cookie" elementType="Cookie" testname="revdebug.jwt.cookie">
<stringProp name="Cookie.value">eyJhbGciOiJBMTI4S1ciLCJlbmMiOiJBMTI4Q0JDLUhTMjU2IiwidHlwIjoiSldUIiwiY3R5IjoiSldUIn0.9JgWo207LrpfE35SBEbmV__x758N3ispvUQouai_lh4hKSgv-f8_hw.lQn5eEiriaosN0QxWsH92A.sYsVkVnlMt_ZoJv3iXkCFqoZFZhpijwLxsKnAy4B83wgXZWBsDjfwAHfwAQ5gcjWRijnWr1kA1OpZOMKyk2O3qjz_NJ93HA3azT9XhRIP7ZUknxH-GPnpXBGOgieXHumF3rySxhbZRSc5XhYZBFjAzAqDDImlO2xc4jrs3QULiTfROEykw1c-fuhbrRkW-jglbWTuDRGszGNdn7Jg-ffUBEP3UMOuaqwkQTIaqBXag8xGE8VyMoMCl3rlYqTxKGGBF9gv2AKwpTfy7Twc9vF3sH7tMZ1TYYO4bEt6XrqTQZfaTLAcXsCJgXOWWWqNMJpUqCBv3Z-F050FaxVb_6txfykjxNqVIQXAv5lEOO4EKSQbBVVfo0q77SFCQOwsEh9EdpaSgW8yn6D_vJejPC3pw.Y0vbl-nyjFZ3tcGwFcFiLw</stringProp>
<stringProp name="Cookie.domain">20.199.127.147</stringProp>
<stringProp name="Cookie.path">/</stringProp>
<boolProp name="Cookie.secure">False</boolProp>
<longProp name="Cookie.expires">0</longProp>
<boolProp name="Cookie.path_specified">true</boolProp>
<boolProp name="Cookie.domain_specified">true</boolProp>
</elementProp>         </collectionProp>        <boolProp name="CookieManager.clearEachIteration">false</boolProp>        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>      </CookieManager>      <hashTree/>      <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="HTTP Cache Manager" enabled="true">        <boolProp name="clearEachIteration">true</boolProp>        <boolProp name="useExpires">false</boolProp>        <boolProp name="CacheManager.controlledByThread">false</boolProp>      </CacheManager>      <hashTree/>      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="thread" enabled="true">          <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">          <boolProp name="LoopController.continue_forever">false</boolProp>          <intProp name="LoopController.loops">-1</intProp>        </elementProp>        <stringProp name="ThreadGroup.num_threads">100</stringProp>        <stringProp name="ThreadGroup.ramp_time">1</stringProp>        <boolProp name="ThreadGroup.scheduler">true</boolProp>       <stringProp name="ThreadGroup.duration">20</stringProp>        <stringProp name="ThreadGroup.delay">0</stringProp>        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>      </ThreadGroup>      <hashTree>        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Test" enabled="true">          <boolProp name="TransactionController.includeTimers">false</boolProp>          <boolProp name="TransactionController.parent">false</boolProp>        </TransactionController>        <hashTree>           <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="/home" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
              <stringProp name="HTTPSampler.domain">${BASE_URL_1}</stringProp>
              <stringProp name="HTTPSampler.port">${PORT}</stringProp>
              <stringProp name="HTTPSampler.protocol">http</stringProp>
              <stringProp name="HTTPSampler.path">/home</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <stringProp name="HTTPSampler.connect_timeout">600000</stringProp>
            <stringProp name="HTTPSampler.response_timeout">600000</stringProp>
            </HTTPSamplerProxy>
          <hashTree>
              <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
                <stringProp name="ConstantTimer.delay">19999</stringProp>
              </ConstantTimer>
              <hashTree/>
            </hashTree>        </hashTree>      </hashTree>    </hashTree>  </hashTree></jmeterTestPlan>